Revit 2027 API
BuiltInFailures.ColumnInsideWallFailures.CopingWarningOffset Property
 Coping applied, but no cut was made. Adjust Coping Distance or Offset parameters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CopingWarningOffset { get; }
Public Shared ReadOnly Property CopingWarningOffset As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CopingWarningOffset {
	FailureDefinitionId^ get ();
}
static member CopingWarningOffset : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ColumnInsideWallFailures Class
Autodesk.Revit.DB Namespace